# FbxLightLimunousFlux Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FbxLightLimunousFlux Property
ParameterTypeId Class See Also
---
"Luminous Flux"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FbxLightLimunousFlux { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FbxLightLimunousFlux As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FbxLightLimunousFlux {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace